In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3),
                   index=['BJ','SH','GZ'],columns=['A','B','C'])
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [3]:
df1.index = pd.Series(['bj','sh','gz'])
df1

    A  B  C
bj  0  1  2
sh  3  4  5
gz  6  7  8

In [4]:
df1.index = df1.index.map(str.upper)
df1

    A  B  C
BJ  0  1  2
SH  3  4  5
GZ  6  7  8

In [5]:
df1.rename(index=str.lower,columns=lambda x:x+'_ABC')

    A_ABC  B_ABC  C_ABC
bj      0      1      2
sh      3      4      5
gz      6      7      8

In [6]:
df1.rename(index={'BJ':'beijing'},columns={'A':'a'})

         a  B  C
beijing  0  1  2
SH       3  4  5
GZ       6  7  8